<template>
    <div id="Xieyi" class="xieyibox" @click="closeLayer">
        <div>
            储值卡消费者服务协议（以下简称“本协议”）是Lovzvzu产品的商家（以下简称“商家”）与在Lovzvzu商家店铺的消费者（以下简称“用户”或“您”）就Lovzvzu“商家储值卡”服务（以下简称“本服务”）相关事项所订立的有效合约。您通过网络页面点击确认或以其他方式选择接受本协议，即表示您与商家已达成协议并同意接受本协议的全部约定内容以及同意Lovzvzu关于本协议有关的已经发布或将来可能发布的各项规则、页面提示、操作流程、公告和通知（以下统称“本协议”）。
            <br/>在接受本协议之前， 请您仔细阅读本协议的全部内容。如果您不同意本协议的任意内容，或者无法准确理解商家对条款的解释，请不要进行后续操作。
            <br/>1、“商家储值卡”是商家在自己的Lovzvzu店铺发行并售卖的仅限于在发卡主体所属门店使用的电子虚拟卡，商家储值卡内余额可抵现金使用，持卡消费者每次消费时仅支付实际消费的部分，剩余款项可下次继续使用。
            <br/>2、在商家发行商家储值卡时，可以设置具体储值卡的名称，如XX储值卡等，不论储值卡是何名称，均遵照本规则。
            <br/>3、您购买商家储值卡后即可能成为商家的会员（具体以页面提示为准），您购买储值卡即表示同意Lovzvzu向商家提供您的部分信息，包括但不限于用户名、手机号、储值卡卡号、支付宝账户名等。如您购卡或者充值金额达1万元或以上的，应当提交购卡人的姓名、有效身份证件及联系方式，办理实名登记。
            <br/>4、您在购买商家储值卡前，应仔细阅读该商家储值卡的使用规则，包括但不限于适用门店范围、有效期、使用规则、退卡规则等，用户在购买或充值后，即视为您已经知悉并同意商家储值卡的使用规则等。
            <br/>5、如商家对储值卡的适用门店有调整的，以商家实际支持的门店为准。
            <br/>6、如您在一张商家储值卡中充值了多笔款项的，在使用时，您授权Lovzvzu根据商家储值卡内充值款项的充值时间、充值款项有效期等信息决定每笔充值款项的扣款顺序。
            <br/>7、如您进行储值卡充值时参与了商家的赠送活动的，在使用时，Lovzvzu将根据商家的活动规则决定您的充值金额与赠送金额的扣款顺序。您在参与该充赠活动前应充分了解相应的活动规则，一旦您充值成功即视为您已经知悉并同意相应的使用规则等。
            <br/>8、当您使用商家储值卡消费后，如发生退货/退款的，您使用储值卡支付的金额将被退回该储值卡内。
            <br/>9、商家储值卡的退卡规则、退卡手续费等以商家储值卡说明页面为准。
            <br/>10、商家储值卡的具体有效期以储值卡说明页面为准。储值卡有效期届满后，您可向商家提出退款或延长有效期的申请；商家应根据您的申请为您理退款或延期。
            <br/>11、您理解并同意，如商家为持卡您办理退款或延期的，商家有可能因该退款或延期行为向您收取延期手续费，具体手续费以储值卡说明页面或您与商家协商的结果为准。
            <br/>12、商家开展其他优惠活动时，对于享受优惠的订单可能无法使用商家储值卡进行支付，具体以商家的优惠活动规则为准。
            <br/>13、商家发行储值卡，储值卡的使用和核销，及您使用商家储值卡过程中产生的体验感受、服务品质等，均由商家负责，Lovzvzu仅提供平台展示和系统服务，不负有任何明示或默示的担保责任。如您与商家因商家储值卡的使用而发生任何争议，包括但不限于商家提供的商品或服务的质量、价格、有效期、退货退款、退卡、售后服务、服务态度、储值卡无法使用等问题发生争议的，您应与商家采取协商或其他方式予以解决。
            <br/>14、关于本协议内容您和商家或者您和Lovzvzu发生纠纷，可向被告所在地有管辖权的法院提起诉讼。
            <br/>15、Lovzvzu有权对本协议进行单方面调整变更，并以Lovzvzu商家社区予以公布，无需另行通知您；若您在本协议内容变更公告后继续使用本服务的，则表示您已充分阅读、理解并接受修改后的协议，也将遵循修改后的协议；若您不同意修改后的协议内容，您应停止使用本服务。
        </div>
    </div>
</template>

<script>
export default {
    name: 'Xieyi',
    methods: {
        closeLayer: function () {
            this.$emit('close')
        }
    }
}
</script>

<style lang="scss">
    .xieyibox{
        position: fixed;
        z-index: 99;
        left: 0;
        top: 0;
        width: 100%;
        height: 100%;
        background-color: rgba(0, 0, 0, .6);
        div {
            background-color: #fff;
            border-radius: .1ren;
            width: 6.5rem;
            height: 90%;
            margin: 5% .5rem;
            padding: .2rem;
            box-sizing: border-box;
            overflow-y: auto;
        }
    }
</style>
